// ----------------------
// 숫자(number) 값
// ----------------------
// 정수
123;

// 소수
0.12;

// 실수
101.21;

// 음수
-89;

// 문자(string) 값
("2");
("3");
`4`;

// ------------------------------------
// 논리(boolean) 값
// - 진실 (truthy, true)
// - 거짓 (falsy, false)
// ------------------------------------

// 프로그램이 허용하지 않는 문자 (정의 되지 않은)
// --truthy;
// --falsey;
// --yes;
// --ok;
// --no;

// 프로그램이 허용하는 문자 (정의 된)
true;
false;

// 터미널에 값 출력

// 주석 한 줄 (single line comment)

// 주석 여러 줄 (multiple line comments)
